W4D4/music/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "VXGybiWh2kf4RoykhvBjww"], ["LIMIT", 1]]
---
  def current_user
    @user ||= User.find_by(session_token: session[:session_token])