W4D4/music/app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
      if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Song Peoples"], ["updated_at", "2019-01-31 23:13:04.559828"], ["id", 1]]

  def destroy
    @band = Band.find(params[:id])
    if @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]