aA_Homework/W4D4/music/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
  <select id="band_id" name="album[band_id]">
  <% Band.all.each do |band| %>