W4D4/music/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums"
---
<% albums = Album.all %>