W4D2/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" ORDER BY "cats"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2015-01-03"], ["description", "Nevermind"], ["updated_at", "2019-01-30 01:04:19.737534"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)

INSERT INTO "cats" ("color", "name", "description", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "purple"], ["name", "cat first"], ["description", "  "], ["birth_date", "2015-01-20"], ["created_at", "2019-01-30 00:53:05.282896"], ["updated_at", "2019-01-30 00:53:05.282896"]]
---
  def create
    @cat = Cat.create!(cat_params)