aA_Homework/W4D4/music/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 3], ["title", "Next title"], ["year", 2000], ["created_at", "2019-02-01 00:52:12.339819"], ["updated_at", "2019-02-01 00:52:12.339819"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "live_version" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live_version", true], ["updated_at", "2019-02-01 00:52:20.479841"], ["id", 4]]
---
  def update
    @album = Album.find(params[:id])
      if @album.update_attributes(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]
---
  def destroy
    @album= Album.find(params[:id])
    if @album.destroy