aA_Homework/W4D4/music/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "k@k.com"], ["password_digest", "$2a$10$2eE2./hI/de0aJFIe.LuKeyeY8HrZFONeIeTPApmGEyhwXvgUtWju"], ["updated_at", "2019-01-31 22:36:45.267510"], ["id", 7]]