aA_Homework/W4D4/music/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "k"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = self.find_by(email: email)